app/controllers/contact_apps_controller.rb

  def index
    @contact_apps = ContactApp.all
---
SELECT "contact_apps".* FROM "contact_apps"

  def create
    @contact_app = ContactApp.new(contact_app_params)

    respond_to do |format|
      if @contact_app.save
---
INSERT INTO "contact_apps" ("First_name", "Last_Name", "Phone", "Telephone", "Work_Phone", "Email_Id", "Work_Email", "Github_Id", "Facebook_Id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @contact_app.destroy
---
DELETE FROM "contact_apps" WHERE "contact_apps"."id" = ?  [["id", 1]]

    def set_contact_app
      @contact_app = ContactApp.find(params[:id])
---
SELECT  "contact_apps".* FROM "contact_apps" WHERE "contact_apps"."id" = ? LIMIT 1  [["id", 3]]